InformationRegisters/RenaultFlotte_ИсторияКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>RenaultFlotte_ИсторияКомментариев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/RenaultFlotte_ИсторияКомментариев/Ext/ManagerModule.bsl
Процедура ДобавитьКомментарий(Знач ИдОбъекта, Текст, Автор, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(ИдОбъекта) <> Тип("Строка") Тогда
		ИдОбъекта = Строка(ИдОбъекта);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.RenaultFlotte_ИсторияКомментариев.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяУниверсальнаяДата();
	Если Дата <> Неопределено Тогда
		МенеджерЗаписи.Период = Дата;
	КонецЕсли;
	МенеджерЗаписи.Объект = ИдОбъекта;
	МенеджерЗаписи.Автор = Автор;
	Если НЕ Renault_ОбщиеФункцииСервер.ЭтоФоновоеЗадание() Тогда
		Текст = "Сотрудник:" + ПараметрыСеанса.Пользователь + ", " + Текст;
	КонецЕсли;
	МенеджерЗаписи.Сообщение = Текст;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьКомментарииПоОбъекту(Знач ИдОбъекта)
	
	Если ТипЗнч(ИдОбъекта) <> Тип("Строка") Тогда
		ИдОбъекта = Строка(ИдОбъекта);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	RenaultFlotte_ИсторияКомментариев.Период КАК Период,
		|	RenaultFlotte_ИсторияКомментариев.Объект,
		|	RenaultFlotte_ИсторияКомментариев.Автор,
		|	RenaultFlotte_ИсторияКомментариев.Сообщение
		|ИЗ
		|	РегистрСведений.RenaultFlotte_ИсторияКомментариев КАК RenaultFlotte_ИсторияКомментариев
		|ГДЕ
		|	RenaultFlotte_ИсторияКомментариев.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("Объект", ИдОбъекта);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьКомментарииПоОбъектуСтрокой(Знач ИдОбъекта) Экспорт
	
	Если ТипЗнч(ИдОбъекта) <> Тип("Строка") Тогда
		ИдОбъекта = Строка(ИдОбъекта);
	КонецЕсли;
	
	ТаблицаКомментарии = ПолучитьКомментарииПоОбъекту(ИдОбъекта);
	СтрокаКомментарии = "";
	Для Каждого СтрокаТаблицы Из ТаблицаКомментарии Цикл
		СтрокаКомментарии = 
			СтрокаКомментарии + 
			Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2: %3",
				МестноеВремя(СтрокаТаблицы.Период, ЧасовойПоясСеанса()),
				Строка(СтрокаТаблицы.Автор),
				СтрокаТаблицы.Сообщение)+
			Символы.ПС;
	КонецЦикла;
	
	Возврат СтрокаКомментарии;
	
КонецФункции

Функция НайтиКомментарийПоОбъекту(Знач ИдОбъекта, Текст) Экспорт
	
	Если ТипЗнч(ИдОбъекта) <> Тип("Строка") Тогда
		ИдОбъекта = Строка(ИдОбъекта); 	
	КонецЕсли;
	
	ТаблицаКомментарии = ПолучитьКомментарииПоОбъекту(ИдОбъекта);
	СтрокаКомментарии = "";
	Для Каждого СтрокаТаблицы Из ТаблицаКомментарии Цикл
		Если Найти(СтрокаТаблицы.Сообщение, Текст) <> 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
